In [1]:
import pandas as pd 
import seaborn as sns
import numpy as np
import matplotlib.pyplot as plt

In [2]:
data = pd.read_csv('C:/Users/joao_/Desktop/4 ANO JOAO/SINO/DataSets SINO/bank/bank-full.csv', sep = ";")

In [3]:
data.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown,no
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown,no
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown,no
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown,no
4,33,unknown,single,unknown,no,1,no,no,unknown,5,may,198,1,-1,0,unknown,no

In [4]:
data.shape

(45211, 17)

In [5]:
data['y']

0         no
1         no
2         no
3         no
4         no
        ...
45206    yes
45207    yes
45208    yes
45209     no
45210     no
Name: y, Length: 45211, dtype: object

In [6]:
data.describe()

,age,balance,day,duration,campaign,pdays,previous
count,45211.000000,45211.000000,45211.000000,45211.000000,45211.000000,45211.000000,45211.000000
mean,40.936210,1362.272058,15.806419,258.163080,2.763841,40.197828,0.580323
std,10.618762,3044.765829,8.322476,257.527812,3.098021,100.128746,2.303441
min,18.000000,-8019.000000,1.000000,0.000000,1.000000,-1.000000,0.000000
25%,33.000000,72.000000,8.000000,103.000000,1.000000,-1.000000,0.000000
50%,39.000000,448.000000,16.000000,180.000000,2.000000,-1.000000,0.000000
75%,48.000000,1428.000000,21.000000,319.000000,3.000000,-1.000000,0.000000
max,95.000000,102127.000000,31.000000,4918.000000,63.000000,871.000000,275.000000

In [7]:
data_yes = data[data.y == 'yes']

In [8]:
data_yes

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
83,59,admin.,married,secondary,no,2343,yes,no,unknown,5,may,1042,1,-1,0,unknown,yes
86,56,admin.,married,secondary,no,45,no,no,unknown,5,may,1467,1,-1,0,unknown,yes
87,41,technician,married,secondary,no,1270,yes,no,unknown,5,may,1389,1,-1,0,unknown,yes
129,55,services,married,secondary,no,2476,yes,no,unknown,5,may,579,1,-1,0,unknown,yes
168,54,admin.,married,tertiary,no,184,no,no,unknown,5,may,673,2,-1,0,unknown,yes
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
45204,73,retired,married,secondary,no,2850,no,no,cellular,17,nov,300,1,40,8,failure,yes
45205,25,technician,single,secondary,no,505,no,yes,cellular,17,nov,386,2,-1,0,unknown,yes
45206,51,technician,married,tertiary,no,825,no,no,cellular,17,nov,977,3,-1,0,unknown,yes
45207,71,retired,divorced,primary,no,1729,no,no,cellular,17,nov,456,2,-1,0,unknown,yes
45208,72,retired,married,secondary,no,5715,no,no,cellular,17,nov,1127,5,184,3,success,yes

In [15]:
data_yes['job'].value_counts()

management       1301
technician        840
blue-collar       708
admin.            631
retired           516
services          369
student           269
unemployed        202
self-employed     187
entrepreneur      123
housemaid         109
unknown            34
Name: job, dtype: int64

In [9]:
print(data_yes['age'].value_counts().idxmax())
print(data_yes['job'].value_counts().idxmax())
print(data_yes['marital'].value_counts().idxmax())
print(data_yes['education'].value_counts().idxmax())
print(data_yes['month'].value_counts().idxmax())
print(data_yes['day'].value_counts().idxmax())
print(data_yes['balance'].value_counts().idxmax())
print(data_yes['housing'].value_counts().idxmax())
print(data_yes['campaign'].value_counts().idxmax())
print(data_yes['previous'].value_counts().idxmax())
print(data_yes['default'].value_counts().idxmax())
print(data_yes['loan'].value_counts().idxmax())

32
management
married
secondary
may
30
0
no
1
0
no
no

In [10]:
data_yess ={'Idade': [data_yes['age'].value_counts().idxmax()],
'Profissão': [data_yes['job'].value_counts().idxmax()],
'Estado civil': [data_yes['marital'].value_counts().idxmax()],
'Educação': [data_yes['education'].value_counts().idxmax()],
'Mês': [data_yes['month'].value_counts().idxmax()],
'Dia': [data_yes['day'].value_counts().idxmax()],
'Balanço': [data_yes['balance'].value_counts().idxmax()],
'Crédito habitação': [data_yes['housing'].value_counts().idxmax()],
'Campanha': [data_yes['campaign'].value_counts().idxmax()],
'Previous': [data_yes['previous'].value_counts().idxmax()],
'Default': [data_yes['default'].value_counts().idxmax()],
'Empréstmo': [data_yes['loan'].value_counts().idxmax()],
'Resultado': [data_yes['y'].value_counts().idxmax()]
}
data_yess = pd.DataFrame(data_yess)
data_yess
data_yess.to_excel("data_yes.xlsx", index=False)

In [11]:
data_yess

,Idade,Profissão,Estado civil,Educação,Mês,Dia,Balanço,Crédito habitação,Campanha,Previous,Default,Empréstmo,Resultado
0,32,management,married,secondary,may,30,0,no,1,0,no,no,yes

In [12]:
data_yes

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
83,59,admin.,married,secondary,no,2343,yes,no,unknown,5,may,1042,1,-1,0,unknown,yes
86,56,admin.,married,secondary,no,45,no,no,unknown,5,may,1467,1,-1,0,unknown,yes
87,41,technician,married,secondary,no,1270,yes,no,unknown,5,may,1389,1,-1,0,unknown,yes
129,55,services,married,secondary,no,2476,yes,no,unknown,5,may,579,1,-1,0,unknown,yes
168,54,admin.,married,tertiary,no,184,no,no,unknown,5,may,673,2,-1,0,unknown,yes
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
45204,73,retired,married,secondary,no,2850,no,no,cellular,17,nov,300,1,40,8,failure,yes
45205,25,technician,single,secondary,no,505,no,yes,cellular,17,nov,386,2,-1,0,unknown,yes
45206,51,technician,married,tertiary,no,825,no,no,cellular,17,nov,977,3,-1,0,unknown,yes
45207,71,retired,divorced,primary,no,1729,no,no,cellular,17,nov,456,2,-1,0,unknown,yes
45208,72,retired,married,secondary,no,5715,no,no,cellular,17,nov,1127,5,184,3,success,yes

In [13]:
data_yes = pd.DataFrame(data_yes)
data_yes
data_yes.to_excel("todos_os_clientes.xlsx", index=False)

In [ ]:
subscrição ={'Idade': 'Mais de 60 anos',
'Profissão': 'Estudante',
'Estado civil': 'Solteiro',
'Educação': 'Terciária',
'Mês': 'Março',
'Dia': 'Primeira Quinzena',
'Balanço': 'Entre 2500 e 500',
'Crédito habitação': 'Não',
'Campanha': 'Uma vez',
'Previous': 'Mais do que uma vez',
'Default': 'Não possuí',
'Empréstmo': 'Não'
}
subscrição

In [21]:
sub = pd.DataFrame({'Idade': 'Mais de 60 anos',
'Profissão': 'Estudante',
'Estado civil': 'Solteiro',
'Educação': 'Terciária',
'Mês': 'Março',
'Dia': 'Primeira Quinzena',
'Balanço': 'Entre 2500 e 500',
'Crédito habitação': 'Não',
'Campanha': 'Uma vez',
'Previous': 'Mais do que uma vez',
'Default': 'Não possuí',
'Empréstmo': 'Não'
}, index=[0])
sub
sub.to_excel("subscrição.xlsx", index=False)